---
kind: method
id: M:Autodesk.Revit.DB.WorksetId.op_Equality(Autodesk.Revit.DB.WorksetId,Autodesk.Revit.DB.WorksetId)
source: html/78434aed-7129-58e8-2e5e-d2ed787b3483.htm
---
# Autodesk.Revit.DB.WorksetId.op_Equality Method

Determines whether these two WorksetIds are the same.

## Syntax (C#)
```csharp
public static bool operator ==(
	WorksetId first,
	WorksetId second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.WorksetId`) - The first WorksetId.
- **second** (`Autodesk.Revit.DB.WorksetId`) - The second WorksetId.

## Returns
True if the WorksetIds are the same; otherwise, false.